tests/artillery/concurrency.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
  http:
    timeout: 10
  processor: "./processor.cjs"

scenarios:
  - name: "Each user sends 10 messages quickly"
    flow:
      - loop:
          - function: "sendMessage"
          - put:
              url: "/api/new-message"
              json: "{{ messagePayload }}"
          - think: 0.4
        count: 10